Repository: alx741/license-recomendations-es
Catalog: license-recommendations.*.po
Languages: es

source: How to choose a license for your own work - GNU Project - Free Software Foundation
es: Como elegir una licencia para su trabajo - Proyecto GNU - <cite>Free Software Foundation</cite>

source: How to choose a license for your own work
es: Como elegir una licencia para su trabajo

source: Introduction
es: Introducción

source: People often ask us what license we recommend they use for their project. We've written about this publicly before, but the information has been scattered around between different essays, FAQ entries, and license commentaries. This article collects all that information into a single source, to make it easier for people to follow and refer back to.
es: Las personas con frecuencia nos preguntan que licencia recomendaríamos usar para su proyecto. Hemos publicado sobre esto antes, pero la información ha sido dispersada entre varios ensayos, listas de preguntas frecuentes, y comentarios de licencia. Este articulo recolecta toda esa información en una única fuente, para hacer más sencillo su uso como referencia.

source: These recommendations are for works designed to do practical jobs. Those include software, documentation, and some other things. Works of art, and works that state a point of view, are different issues; the GNU Project has no general stand about how they should be released, except that they should all be usable without nonfree software (in particular, <a href="http://defectivebydesign.org/">without DRM</a>). However, you might want to follow these recommendations for art works that go with a particular program.
es: Estas recomendaciones están orientadas a trabajos diseñados para uso práctico. Estos incluyen: software, documentación, entre otros. Trabajos de arte y trabajos que exponen un punto de vista son problemas distintos, el proyecto GNU no tiene una postura general sobre como deberían ser publicados, excepto que deberían poder ser utilizados sin software privativo (en particular <a href="http://defectivebydesign.org/">sin DRM</a>). Sin embargo, usted podría querer seguir estas recomendaciones para trabajos de arte que son incluidos en un programa en particular.

source: The recommendations apply to licensing a work that you create&mdash;whether that's a modification of an existing work, or a new original work. They do not address the issue of combining existing material under different licenses. If you're looking for help with that, please check <a href="/licenses/gpl-faq.html">our GPL FAQ</a>.
es: Las recomendaciones aplican al licenciamiento del trabajo que usted crea, sea que es la modificación de un trabajo existente, o un nuevo trabajo original. Estas recomendaciones no abordan el problema de combinar material existente bajo diferentes licencias. Si usted busca ayuda con eso, por favor revise <a "href="/licenses/gpl-faq.html">nuestra lista de preguntas frecuentes sobre GPL</a>.

source: After you see what we recommend here, if you'd like advice, you can write to <a href="mailto:licensing@gnu.org">&lt;licensing@gnu.org&gt;</a>. Note that it will probably take a few weeks for the licensing team to get back to you; if you get no response in a month, please write again.
es: Si luego de ver lo que recomendamos aquí, usted desea asesoramiento, puede escribir a <a href="mailto:licensing@gnu.org">&lt;licensing@gnu.org&gt;</a>. Recuerde que al equipo de licenciamiento probablemente le tomará varias semanas responder, si no obtiene respuesta en un mes, por favor escriba nuevamente.

source: Contributing to an existing project
es: Contribuyendo a un proyecto existente

source: When you contribute to an existing project, you should usually release your modified versions under the same license as the original work. It's good to cooperate with the project's maintainers, and using a different license for your modifications often makes that cooperation very difficult. You should only do that when there is a strong reason to justify it.
es: Cuando se contribuye a un proyecto existente se debería publicar la versión modificada bajo la misma licencia que el trabajo original. Es bueno cooperar con quienes mantienen el proyecto, y usar una licencia distinta para sus modificaciones usualmente dificulta la cooperación. Debería hacerlo únicamente cuando existe una razón de peso para justificarlo.

source: One case where using a different license can be justified is when you make major changes to a work under a non-copyleft license. If the version you've created is considerably more useful than the original, then it's worth copylefting your work, for all the same <a href="/copyleft/copyleft.html">reasons we normally recommend copyleft</a>. If you are in this situation, please follow the recommendations below for licensing a new project.
es: Un caso en el que usar una licencia distinta puede ser justificado es cuando se realizan cambios significativos a un trabajo bajo una licencia no copyleft. Si la versión que usted ha creado es considerablemente mas útil que el original, entonces merece ser licenciado con copyleft, por los mismos <a "href="/copyleft/copyleft.html">motivos que normalmente recomendamos copyleft</a>. Si se encuentra en esta situación, por favor siga las recomendaciones de abajo para el licenciamiento de un nuevo proyecto.

source: If you choose to release your contributions under a different license for whatever reason, you must make sure that the original license allows use of the material under your chosen license. For honesty's sake, show explicitly which parts of the work are under which license.
es: Si usted elige publicar sus contribuciones bajo una licencia distinta por cualquier motivo, debe asegurarse que la licencia original permite el uso del material bajo la licencia que ha elegido. Por honestidad, muestre explícitamente que partes del trabajo se encuentran bajo que licencia.

source: We recommend different licenses for different projects, depending mostly on the software's purpose. In general, we recommend using the strongest copyleft license that doesn't interfere with that purpose. Our essay <a href="/copyleft/copyleft.html">&ldquo;What is Copyleft?&rdquo;</a> explains the concept of copyleft in more detail, and why it is generally the best licensing strategy.
es: Recomendamos diferentes licencias para diferentes proyectos, dependiendo principalmente del propósito del software. En general, recomendamos usar la licencia copyleft más fuerte que no interfiera con ese propósito. Nuestro ensayo <a "href="/copyleft/copyleft.html">&ldquo;Qué es Copyleft?&rdquo;</a> explica el concepto de copyleft en más detalle, y por qué es generalmente considerado la mejor estrategia de licenciamiento.

source: For most programs, we recommend that you use the most recent version of the <a href="/licenses/gpl.html">GNU General Public License (GPL)</a> for your project. Its strong copyleft is appropriate for all kinds of software, and includes numerous protections for users' freedom.
es: Para la mayoría de programas, recomendamos que use la versión más reciente de la <a href="/licenses/gpl.html">Licencia Pública General de GNU (GPL)</a> para su proyecto. Su copyleft fuerte es apropiado para todo tipo de software, e incluye numerosas protecciones para la libertad de los usuarios.

source: Now for the exceptions.
es: Ahora para las excepciones

source: Small programs
es: Programas pequeños

source: It is not worth the trouble to use copyleft for most small programs. We use 300 lines as our benchmark: when a software package's source code is shorter than that, the benefits provided by copyleft are usually too small to justify the inconvenience of making sure a copy of the license always accompanies the software.
es: No amerita el esfuerzo usar copyleft para la mayoría de programas pequeños. Usamos 300 lineas como nuestro punto de referencia, cuando el código de un paquete de software es más pequeño que eso, los beneficios que provee copyleft son usualmente muy pequeños para justificar la inconveniencia de asegurarse que una copia de la licencia acompañe siempre al software.

source: For those programs, we recommend the <a href="http://www.apache.org/licenses/LICENSE-2.0">Apache License 2.0</a>. This is a pushover (non-copyleft) software license that has terms to prevent contributors and distributors from suing for patent infringement. This doesn't make the software immune to threats from patents (a software license can't do that), but it does prevent patent holders from setting up a &ldquo;bait and switch&rdquo; where they release the software under free terms then require recipients to agree to nonfree terms in a patent license.
es: Para esos programas, recomendamos la <a href="http://www.apache.org/licenses/LICENSE-2.0">Licencia Apache 2.0</a>. Esta es una licencia de software no copyleft con términos para evitar demandas de contribuidores y distribuidores por violación de patentes. Esto no hace el software inmute a amenazas de patentes (una licencia de software no puede hacerlo), pero impide a los poseedores de las patentes realizar una táctica engañosa en la que el software se publica bajo términos libres y luego solicita a los usuarios aceptar los términos no libres en una licencia de patente.

source: Among the lax pushover licenses, Apache 2.0 is best; so if you are going to use a lax pushover license, whatever the reason, we recommend using that one.
es: Entre las licencias permisivas, Apache 2.0 es la mejor. Así que recomendamos usarla si por cualquier motivo se va a emplear una una licencia permisiva.

source: Libraries
es: Librerías

source: For libraries, we distinguish three kind of cases.
es: Para las librerías, distinguimos entre tres tipos de casos.

source: Some libraries implement free standards that are competing against restricted standards, such as Ogg Vorbis (which competes against MP3 audio) and WebM (which competes against MPEG-4 video). For these projects, widespread use of the code is vital for advancing the cause of free software, and does more good than a copyleft on the project's code would do.
es: Algunas librerías implementan estándares libres que compiten con estándares restrictivos, como Ogg Vorbis (que compite con MP3) y WebM (que compite con MPEG-4). Para estos proyectos, el uso extendido del código es vital para promover la causa del software libre, y beneficia más que una licencia copyleft en el código.

source: In these special situations, we recommend the <a href="http://www.apache.org/licenses/LICENSE-2.0">Apache License 2.0</a>.
es: En estas situaciones especiales, recomendamos la <a href="http://www.apache.org/licenses/LICENSE-2.0">Licencia Apache 2.0</a>.

source: For all other libraries, we recommend some kind of copyleft. If developers are already using an established alternative library released under a nonfree license or a lax pushover license, then we recommend using the <a href="/licenses/lgpl.html">GNU Lesser General Public License (LGPL)</a>.
es: Para todas las demás librerías, recomendamos algún tipo de licencia copyleft. Si los desarrolladores ya están usando una librería alternativa, publicada bajo una licencia no libre, o una licencia permisiva, entonces recomendamos usa la <a "href="/licenses/lgpl.html">Licencia Pública General Reducida de GNU (LGPL)</a>.

source: Unlike the first case, where the library implements an ethically superior standard, here adoption for its own sake will not accomplish any special objective goal, so there's no reason to avoid copyleft entirely. However, if you require developers who use your library to release their whole programs under copyleft, they'll simply use one of the alternatives available, and that won't advance our cause either. The Lesser GPL was designed to fill the middle ground between these cases, allowing proprietary software developers to use the covered library, but providing a weak copyleft that gives users freedom regarding the library code itself.
es: A diferencia del primer caso, donde la librería implementa un estándar éticamente superior, aquí la adopción por si misma no logrará ningún objetivo especial en particular, así que no hay motivo para evitar una licencia copyleft. Sin embargo, si usted requiere que los desarrolladores que usan su librería, liberen sus programas completos bajo una licencia copyleft, ellos simplemente usarán una de las alternativas disponibles, y eso tampoco contribuirá a la causa. La licencia GPL reducida fue diseñada para cubrir el espacio entre estos casos, permitiendo que desarrolladores de software propietario utilicen la librería en cuestión, pero proveyendo una forma débil de copyleft que da libertad a los usuarios respecto al código de la librería.

source: For libraries that provide specialized facilities, and which do not face entrenched noncopylefted or nonfree competition, we recommend using the plain GNU GPL. For the reasons why, read <a href="/licenses/why-not-lgpl.html">&ldquo;Why you shouldn't use the Lesser GPL for your next library&rdquo;</a>.
es: Para librerías que proveen características especializadas, y que no afrontan atrincheradas competencias con alternativas no copyleft o no libre, recomendamos usar la licencia GNU GPL. Para conocer los motivos, lea <a "href="/licenses/why-not-lgpl.html">&ldquo;Por qué no debería usar la licencia GPL reducida para su próxima librería&rdquo;</a>.

source: Server Software
es: Software de servidor

source: If it is likely that others will make improved versions of your program to run on servers and not distribute their versions to anyone else, and you're concerned that this will put your released version at a disadvantage, we recommend the <a href="/licenses/agpl.html">GNU Affero General Public License (AGPL)</a>. The AGPL's terms are almost identical to the GPL's; the sole substantive difference is that it has an extra condition to ensure that people who use the software over a network will be able to get the source code for it.
es: Si es probable que otros hagan versiones mejoradas de su programa para ejecutar en servidores sin distribuir sus versiones a nadie mas, y le preocupa que esto ponga su versión publicada en desventaja, recomendamos la <a href="/licenses/agpl.html">Licencia Pública General Affero de GNU (AGPL)</a>. Los términos de la licencia AGPL son prácticamente idénticos a los de la GPL, la única diferencia sustancial es que contempla una condición adicional para asegurar que las personas que usan el software en red, serán capaces de obtener el código fuente del mismo.

source: The AGPL's requirement doesn't address the problems that can arise <em>for users</em> when they entrust their computing or their data to someone else's server. For instance, it won't stop <a href="/philosophy/who-does-that-server-really-serve.html">Service as a Software Substitute (SaaSS)</a> from denying users' freedom&mdash;but most servers don't do SaaSS. For more about these issues, read <a href="/licenses/why-affero-gpl.html">&ldquo;Why the Affero GPL&rdquo;</a>.
es: El requisito de la licencia AGPL no controla los problemas que pueden aparecer <em>para los usuarios</em> cuando intentan confiar su computación o sus datos en el servidor de alguien más. Por ejemplo, no impedirá que <a href="/philosophy/who-does-that-server-really-serve.html">el servicio sustitutivo del software (SaaSS)</a> deniegue a los usuarios su libertad, aunque la mayoría de servidores no utilizan SaaSS. Para conocer más sobre estos problemas, lea <a "href="/licenses/why-affero-gpl.html">&ldquo;Por qué usar la licencia Affero GPL&rdquo;</a>.

source: Documentation
es: Documentación

source: We recommend the <a href="/licenses/fdl.html">GNU Free Documentation License (GFDL)</a> for tutorials, reference manuals and other large works of documentation. It's a strong copyleft license for educational works, initially written for software manuals, and includes terms which specifically address common issues that arise when those works are distributed or modified.
es: Recomendamos la <a href="/licenses/fdl.html">Licencia de Documentación Libre de GNU (GFDL)</a> para tutoriales, manuales de referencia y otros trabajos extensos de documentación. Es una licencia copyleft fuerte para trabajos educacionales, inicialmente escrita para manuales de software, incluye términos para resolver problemas comunes que aparecen cuando estos trabajos son distribuidos o modificados.

source: For short, secondary documentation works, such as a reference card, it is better to use the <a href="/licenses/license-list.html#GNUAllPermissive"> GNU all-permissive license</a>, since a copy of the GFDL could hardly fit in a reference card. Don't use CC-BY, since it is incompatible with the GFDL.
es: Para trabajos de documentación corta y secundaria como tarjetas de referencia, es mejor usar la <a href="/licenses/license-list.html#GNUAllPermissive">Licencia completamente permisiva de GNU</a>, dado que la licencia GFDL difícilmente podría caber en una tarjeta de referencia. No use CC-BY, pues es incompatible con la GFDL.

source: For man pages, we recommend the GFDL if the page is long, and the <a href="/licenses/license-list.html#GNUAllPermissive"> GNU all-permissive license</a> if it is short.
es: Para paginas de manual, recomendamos la GFDL si la pagina es extensa, y la <a "href="/licenses/license-list.html#GNUAllPermissive">Licencia completamente permisiva de GNU</a> si es corta.

source: Some documentation includes software source code. For instance, a manual for a programming language might include examples for readers to follow. You should both include these in the manual under the FDL's terms, and release them under another license that's appropriate for software. Doing so helps make it easy to use the code in other projects. We recommend that you dedicate small pieces of code to the public domain using <a href="http://creativecommons.org/about/cc0">CC0</a>, and distribute larger pieces under the same license that the associated software project uses.
es: Existe documentación que incluye código fuente de software. Por ejemplo, un manual de un lenguaje de programación puede incluir ejemplos a ser seguidos por los lectores. Usted debería incluirlos dentro del manual bajo los términos de la licencia FDL, y publicarlos bajo otra licencia que resulte apropiada para el software. Hacerlo de esta forma facilita usar el código en otros proyectos. Recomendamos que dedique pequeñas piezas de código al dominio publico usando <a href="http://creativecommons.org/about/cc0">CC0</a>, y distribuir piezas de código mas extensas bajo la misma licencia que el proyecto de software asociado utiliza.

source: Other data for programs
es: Otros datos de programas

source: This section discusses all other works for practical use that you might include with software. To give you some examples, this includes icons and other functional or useful graphics, fonts, and geographic data. You can also follow them for art, though we wouldn't criticize if you don't.
es: Esta sección discute todos los demás trabajos para uso práctico que podrían incluirse con el software. Tome come ejemplos: iconos y otros gráficos útiles o funcionales, fuentes y datos geográficos. Usted puede considerarlos como arte, aunque no criticaremos si no lo hace.

source: If you are creating these works specifically for use with a software project, we generally recommend that you release your work under the same license as the software. There is no problem in doing so with the licenses we have recommended: GPLv3, LGPLv3, AGPLv3, and GPLv2 can all be applied to any kind of work&mdash;not just software&mdash;that is copyrightable and has a clear preferred form for modification. Using the same license as the software will help make compliance easier for distributors, and avoids any doubt about potential compatibility issues. Using a different free license may be appropriate if it provides some specific practical benefit, like better cooperation with other free projects.
es: Si está creando estos trabajos para uso especifico con un proyecto de software, generalmente recomendamos que libere su trabajo bajo la misma licencia que el software. No hay problema de hacerlo con las licencias que hemos recomendado: GPLv3, LGPLv3, AGPLv3 y GPLv2 pueden ser aplicadas a cualquier tipo de trabajo (no solamente software) al que puede ser aplicado copyright y tiene una forma preferida y clara para su modificación. Usar la misma licencia que el software facilitará el seguimiento de la misma a los distribuidores y evitará dudas sobre posibles problemas de incompatibilidad. Usar una licencia libre distinta puede resultar apropiado si provee algún beneficio práctico, como una mejor cooperación con otros proyectos libres.

source: If your work is not being created for use with a particular software project, or if it wouldn't be appropriate to use the same license as the project, then we only recommend that you choose a copyleft license that's appropriate for your work. We have some of these <a href="/licenses/license-list.html#OtherLicenses">listed on our license list</a>. If no license seems especially appropriate, the <a href="/licenses/license-list.html#ccbysa">Creative Commons Attribution-ShareAlike</a> license is a copyleft that can be used for many different kinds of works.
es: Si su trabajo no esta siendo creado para ser usado con un proyecto de software en particular, o si usar la misma licencia que el proyecto no resultaría apropiado, entonces solamente recomendamos que elija una licencia copyleft apropiada para su trabajo. Tenemos algunas de ellas <a href="/licenses/license-list.html#OtherLicenses">listadas en nuestra lista de licencias</a>. Si ninguna de ellas parece especialmente apropiada, la licencia copyleft <a href="/licenses/license-list.html#ccbysa">Creative Commons Attribution-ShareAlike</a> puede ser usada para varios tipos diferentes de trabajos.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
es: Envíe sus consultas acerca de la FSF y GNU a <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Existen también <a href="/contact/">otros medios para contactar</a> con la FSF. <br /> Para avisar de enlaces rotos y proponer otras correcciones o sugerencias, diríjase a <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
es: El equipo de traductores al español se esfuerza por ofrecer traducciones fieles al original y de buena calidad, pero no estamos libres de cometer errores.<br /> Por favor envíe sus comentarios y sugerencias sobre las traducciones a <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. </p><p>Consulte la <a href="/server/standards/README.translations.html">Guía para las traducciones</a> para obtener información sobre la coordinación y el envío de traducciones de las páginas de este sitio web.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
es: Esta página está bajo licencia <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/deed.es_ES">Creative Commons

source: Updated:
es: Última actualización:
